CSI API ETABS v1
cOptions.SetDefaultFunctionFolder Method
 Sets the default folder to (recursively) search if a function data file is not found in the specified path or in the model folder. This is a global setting for the user and applies to all models.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetDefaultFunctionFolder(
	string Path
)
Function SetDefaultFunctionFolder (
	Path As String
) As Integer
Dim instance As cOptions
Dim Path As String
Dim returnValue As Integer
returnValue = instance.SetDefaultFunctionFolder(Path)
int SetDefaultFunctionFolder(
	String^ Path
)
abstract SetDefaultFunctionFolder :
        Path : string -> int
Parameters
Path
Type: System.String
Full path to the default function folder.
Return Value
Type: Int32
 Returns zero if the default function folder is successfully set and nonzero if the path is invalid or the folder is not present.
Remarks
Examples
Public Sub Example()
    Dim SapModel As cSapModel
    Dim EtabsObject As cOAPI
    Dim ret As Integer = -1
    'create ETABS object
    Dim myHelper As cHelper = New Helper
    EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
    'start ETABS application
    ret = EtabsObject.ApplicationStart()
    'create SapModel object
    SapModel = EtabsObject.SapModel
    'initialize model
    ret = SapModel.InitializeNewModel()
    'create a blank model from template
    ret = SapModel.File.NewBlank()
    'set default function folder
    Dim path As String = "C:\Functions"
    ret = SapModel.Options.SetDefaultFunctionFolder(path)
    'close ETABS
    EtabsObject.ApplicationExit(False)
    'clean up variables
    SapModel = Nothing
    EtabsObject = Nothing
End Sub
See Also
Reference
cOptions Interface
ETABSv1 Namespace